/*
Navicat MySQL Data Transfer

Source Server         : 127.0.0.1
Source Server Version : 50536
Source Host           : localhost:3306
Source Database       : test

Target Server Type    : MYSQL
Target Server Version : 50536
File Encoding         : 65001

Date: 2019-07-31 21:25:20
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for douban
-- ----------------------------
DROP TABLE IF EXISTS `douban`;
CREATE TABLE `douban` (
  `serial_number` int(11) NOT NULL,
  `movie_name` varchar(255) DEFAULT NULL,
  `introduce` varchar(255) DEFAULT NULL,
  `star` varchar(100) DEFAULT NULL,
  `evaluate` varchar(255) DEFAULT NULL,
  `describe` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`serial_number`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of douban
-- ----------------------------
INSERT INTO `douban` VALUES ('1', '肖申克的救赎', '1994/美国/犯罪剧情', '9.6', '1216082人评价', '希望让人自由。');
INSERT INTO `douban` VALUES ('2', '霸王别姬', '1993/中国大陆香港/剧情爱情同性', '9.6', '894463人评价', '风华绝代。');
INSERT INTO `douban` VALUES ('3', '这个杀手不太冷', '1994/法国/剧情动作犯罪', '9.4', '1119039人评价', '怪蜀黍和小萝莉不得不说的故事。');
INSERT INTO `douban` VALUES ('4', '阿甘正传', '1994/美国/剧情爱情', '9.4', '958890人评价', '一部美国近现代史。');
INSERT INTO `douban` VALUES ('5', '美丽人生', '1997/意大利/剧情喜剧爱情战争', '9.5', '560399人评价', '最美的谎言。');
INSERT INTO `douban` VALUES ('6', '泰坦尼克号', '1997/美国/剧情爱情灾难', '9.3', '894329人评价', '失去的才是永恒的。 ');
INSERT INTO `douban` VALUES ('7', '千与千寻', '2001/日本/剧情动画奇幻', '9.3', '886587人评价', '最好的宫崎骏，最好的久石让。 ');
INSERT INTO `douban` VALUES ('8', '辛德勒的名单', '1993/美国/剧情历史战争', '9.5', '503169人评价', '拯救一个人，就是拯救整个世界。');
INSERT INTO `douban` VALUES ('9', '盗梦空间', '2010/美国英国/剧情科幻悬疑冒险', '9.3', '974971人评价', '诺兰给了我们一场无法盗取的梦。');
INSERT INTO `douban` VALUES ('10', '机器人总动员', '2008/美国/爱情科幻动画冒险', '9.3', '646677人评价', '小瓦力，大人生。');
INSERT INTO `douban` VALUES ('11', '忠犬八公的故事', '2009/美国英国/剧情', '9.3', '632057人评价', '永远都不能忘记你所爱的人。');
INSERT INTO `douban` VALUES ('12', '三傻大闹宝莱坞', '2009/印度/剧情喜剧爱情歌舞', '9.2', '872970人评价', '英俊版憨豆，高情商版谢耳朵。');
INSERT INTO `douban` VALUES ('13', '海上钢琴师', '1998/意大利/剧情音乐', '9.2', '728547人评价', '每个人都要走一条自己坚定了的路，就算是粉身碎骨。 ');
INSERT INTO `douban` VALUES ('14', '放牛班的春天', '2004/法国瑞士德国/剧情音乐', '9.2', '600653人评价', '天籁一般的童声，是最接近上帝的存在。 ');
INSERT INTO `douban` VALUES ('15', '大话西游之大圣娶亲', '1995/香港中国大陆/喜剧爱情奇幻冒险', '9.2', '664832人评价', '一生所爱。');
INSERT INTO `douban` VALUES ('16', '楚门的世界', '1998/美国/剧情科幻', '9.2', '644506人评价', '如果再也不能见到你，祝你早安，午安，晚安。');
INSERT INTO `douban` VALUES ('17', '教父', '1972/美国/剧情犯罪', '9.2', '442078人评价', '千万不要记恨你的对手，这样会让你失去理智。');
INSERT INTO `douban` VALUES ('18', '星际穿越', '2014/美国英国加拿大冰岛/剧情科幻冒险', '9.2', '659141人评价', '爱是一种力量，让我们超越时空感知它的存在。');
INSERT INTO `douban` VALUES ('19', '龙猫', '1988/日本/动画奇幻冒险', '9.1', '542855人评价', '人人心中都有个龙猫，童年就永远不会消失。');
INSERT INTO `douban` VALUES ('20', '熔炉', '2011/韩国/剧情', '9.3', '374293人评价', '我们一路奋战不是为了改变世界，而是为了不让世界改变我们。');
INSERT INTO `douban` VALUES ('21', '无间道', '2002/香港/剧情犯罪悬疑', '9.1', '544855人评价', '香港电影史上永不过时的杰作。');
INSERT INTO `douban` VALUES ('22', '当幸福来敲门', '2006/美国/剧情传记家庭', '9.0', '705653人评价', '平民励志片。 ');
INSERT INTO `douban` VALUES ('23', '触不可及', '2011/法国/剧情喜剧', '9.2', '469426人评价', '满满温情的高雅喜剧。');
INSERT INTO `douban` VALUES ('24', '怦然心动', '2010/美国/剧情喜剧爱情', '9.0', '760471人评价', '真正的幸福是来自内心深处。');
INSERT INTO `douban` VALUES ('25', '乱世佳人', '1939/美国/剧情历史爱情战争', '9.2', '335407人评价', 'Tomorrow is another day.');
INSERT INTO `douban` VALUES ('26', '疯狂动物城', '2016/美国/喜剧动画冒险', '9.2', '723520人评价', '迪士尼给我们营造的乌托邦就是这样，永远善良勇敢，永远出乎意料。');
INSERT INTO `douban` VALUES ('27', '蝙蝠侠：黑暗骑士', '2008/美国英国/剧情动作科幻犯罪惊悚', '9.1', '436916人评价', '无尽的黑暗。');
INSERT INTO `douban` VALUES ('28', '活着', '1994/中国大陆香港/剧情历史家庭', '9.1', '361647人评价', '张艺谋最好的电影。');
INSERT INTO `douban` VALUES ('29', '天堂电影院', '1988/意大利法国/剧情爱情', '9.1', '368056人评价', '那些吻戏，那些青春，都在影院的黑暗里被泪水冲刷得无比清晰。');
INSERT INTO `douban` VALUES ('30', '少年派的奇幻漂流', '2012/美国台湾英国加拿大/剧情奇幻冒险', '9.0', '723342人评价', '瑰丽壮观、无人能及的冒险之旅。');
INSERT INTO `douban` VALUES ('31', '十二怒汉', '1957/美国/剧情', '9.4', '215625人评价', '1957年的理想主义。 ');
INSERT INTO `douban` VALUES ('32', '鬼子来了', '2000/中国大陆/剧情历史战争', '9.2', '299598人评价', '对敌人的仁慈，就是对自己残忍。');
INSERT INTO `douban` VALUES ('33', '指环王3：王者无敌', '2003/美国新西兰/剧情动作奇幻冒险', '9.1', '358912人评价', '史诗的终章。');
INSERT INTO `douban` VALUES ('34', '控方证人', '1957/美国/剧情犯罪悬疑', '9.6', '145960人评价', '比利·怀德满分作品。');
INSERT INTO `douban` VALUES ('35', '搏击俱乐部', '1999/美国德国/剧情动作悬疑惊悚', '9.0', '473755人评价', '邪恶与平庸蛰伏于同一个母体，在特定的时间互相对峙。');
INSERT INTO `douban` VALUES ('36', '天空之城', '1986/日本/动画奇幻冒险', '9.0', '417157人评价', '对天空的追逐，永不停止。 ');
INSERT INTO `douban` VALUES ('37', '飞屋环游记', '2009/美国/剧情喜剧动画冒险', '8.9', '637652人评价', '最后那些最无聊的事情，才是最值得怀念的。 ');
INSERT INTO `douban` VALUES ('38', '大话西游之月光宝盒', '1995/香港中国大陆/喜剧爱情奇幻冒险', '8.9', '535033人评价', '旷古烁今。');
INSERT INTO `douban` VALUES ('39', '罗马假日', '1953/美国/喜剧剧情爱情', '9.0', '482932人评价', '爱情哪怕只有一天。');
INSERT INTO `douban` VALUES ('40', '摔跤吧！爸爸', '2016/印度/剧情传记运动家庭', '9.1', '648272人评价', '你不是在为你一个人战斗，你要让千千万万的女性看到女生并不是只能相夫教子。');
INSERT INTO `douban` VALUES ('41', '窃听风暴', '2006/德国/剧情悬疑', '9.1', '285898人评价', '别样人生。');
INSERT INTO `douban` VALUES ('42', '辩护人', '2013/韩国/剧情', '9.2', '283611人评价', '电影的现实意义大过电影本身。');
INSERT INTO `douban` VALUES ('43', '哈尔的移动城堡', '2004/日本/动画奇幻冒险', '8.9', '452285人评价', '带着心爱的人在天空飞翔。');
INSERT INTO `douban` VALUES ('44', '闻香识女人', '1992/美国/剧情', '9.0', '409937人评价', '史上最美的探戈。');
INSERT INTO `douban` VALUES ('45', '两杆大烟枪', '1998/英国/剧情喜剧犯罪', '9.1', '324793人评价', '4个臭皮匠顶个诸葛亮，盖·里奇果然不是盖的。');
INSERT INTO `douban` VALUES ('46', '飞越疯人院', '1975/美国/剧情', '9.0', '329041人评价', '自由万岁。');
INSERT INTO `douban` VALUES ('47', '死亡诗社', '1989/美国/剧情', '9.0', '351567人评价', '当一个死水般的体制内出现一个活跃的变数时，所有的腐臭都站在了光明的对面。');
INSERT INTO `douban` VALUES ('48', 'V字仇杀队', '2005/美国英国德国/剧情动作科幻惊悚', '8.8', '531781人评价', '一张面具背后的理想与革命。');
INSERT INTO `douban` VALUES ('49', '海豚湾', '2009/美国/纪录片', '9.3', '216388人评价', '海豚的微笑，是世界上最高明的伪装。');
INSERT INTO `douban` VALUES ('50', '教父2', '1974/美国/剧情犯罪', '9.1', '239116人评价', '优雅的孤独。');
INSERT INTO `douban` VALUES ('51', '指环王2：双塔奇兵', '2002/美国新西兰/剧情动作奇幻冒险', '9.0', '336588人评价', '承前启后的史诗篇章。');
INSERT INTO `douban` VALUES ('52', '指环王1：魔戒再现', '2001/新西兰美国/剧情动作奇幻冒险', '8.9', '376900人评价', '传说的开始。');
INSERT INTO `douban` VALUES ('53', '美丽心灵', '2001/美国/传记剧情', '8.9', '374770人评价', '爱是一切逻辑和原由。');
INSERT INTO `douban` VALUES ('54', '饮食男女', '1994/台湾美国/剧情家庭', '9.1', '258895人评价', '人生不能像做菜，把所有的料都准备好了才下锅。');
INSERT INTO `douban` VALUES ('55', '情书', '1995/日本/剧情爱情', '8.8', '462897人评价', '暗恋的极致。');
INSERT INTO `douban` VALUES ('56', '素媛', '2013/韩国/剧情', '9.1', '244570人评价', '受过伤害的人总是笑得最开心，因为他们不愿意让身边的人承受一样的痛苦。');
INSERT INTO `douban` VALUES ('57', '狮子王', '1994/美国/剧情动画冒险歌舞家庭', '8.9', '355052人评价', '动物版《哈姆雷特》。');
INSERT INTO `douban` VALUES ('58', '钢琴家', '2002/法国德国英国波兰/剧情传记历史战争音乐', '9.1', '247272人评价', '音乐能化解仇恨。');
INSERT INTO `douban` VALUES ('59', '美国往事', '1984/意大利美国/犯罪剧情', '9.1', '213002人评价', '往事如烟，无处祭奠。');
INSERT INTO `douban` VALUES ('60', '小鞋子', '1997/伊朗/剧情家庭儿童', '9.2', '179039人评价', '奔跑的孩子是天使。');
INSERT INTO `douban` VALUES ('61', '末代皇帝', '1987/英国意大利中国大陆法国美国/剧情传记历史', '9.0', '246927人评价', '“不要跟我比惨，我比你更惨”再适合这部电影不过了。');
INSERT INTO `douban` VALUES ('62', '七宗罪', '1995/美国/剧情犯罪悬疑惊悚', '8.8', '516204人评价', '警察抓小偷，老鼠玩死猫。');
INSERT INTO `douban` VALUES ('63', '被嫌弃的松子的一生', '2006/日本/剧情歌舞', '8.9', '371818人评价', '以戏谑来戏谑戏谑。');
INSERT INTO `douban` VALUES ('64', '本杰明·巴顿奇事', '2008/美国/剧情爱情奇幻', '8.8', '480893人评价', '在时间之河里感受溺水之苦。');
INSERT INTO `douban` VALUES ('65', '致命魔术', '2006/美国英国/剧情悬疑惊悚', '8.8', '421650人评价', '孪生蝙蝠侠大战克隆金刚狼。');
INSERT INTO `douban` VALUES ('66', '西西里的美丽传说', '2000/意大利美国/剧情战争情色', '8.8', '447746人评价', '美丽无罪。');
INSERT INTO `douban` VALUES ('67', '黑客帝国', '1999/美国澳大利亚/动作科幻', '8.9', '354354人评价', '视觉革命。');
INSERT INTO `douban` VALUES ('68', '天使爱美丽', '2001/法国德国/喜剧爱情', '8.7', '574561人评价', '法式小清新。 ');
INSERT INTO `douban` VALUES ('69', '让子弹飞', '2010/中国大陆香港/剧情喜剧动作西部', '8.7', '784108人评价', '你给我翻译翻译，神马叫做TMD的惊喜。');
INSERT INTO `douban` VALUES ('70', '拯救大兵瑞恩', '1998/美国/剧情历史战争', '8.9', '302635人评价', '美利坚精神输出大片No1.');
INSERT INTO `douban` VALUES ('71', '看不见的客人', '2016/西班牙/剧情犯罪悬疑惊悚', '8.7', '475918人评价', '你以为你以为的就是你以为的。');
INSERT INTO `douban` VALUES ('72', '音乐之声', '1965/美国/剧情传记爱情歌舞', '8.9', '282503人评价', '用音乐化解仇恨，让歌声串起美好。');
INSERT INTO `douban` VALUES ('73', '低俗小说', '1994/美国/剧情喜剧犯罪', '8.8', '413560人评价', '故事的高级讲法。');
INSERT INTO `douban` VALUES ('74', '勇敢的心', '1995/美国/动作传记剧情历史战争', '8.8', '344550人评价', '史诗大片的典范。');
INSERT INTO `douban` VALUES ('75', '大闹天宫', '1961(中国大陆)/1964(中国大陆)/1978(中国大陆)/2004(中国大陆)/中国大陆/动画奇幻', '9.3', '137928人评价', '经典之作，历久弥新。');
INSERT INTO `douban` VALUES ('76', '剪刀手爱德华', '1990/美国/剧情奇幻爱情', '8.7', '584119人评价', '浪漫忧郁的成人童话。');
INSERT INTO `douban` VALUES ('77', '沉默的羔羊', '1991/美国/剧情犯罪惊悚', '8.8', '422308人评价', '安东尼·霍普金斯的顶级表演。');
INSERT INTO `douban` VALUES ('78', '哈利·波特与魔法石', '2001/美国英国/奇幻冒险', '8.8', '354693人评价', '童话世界的开端。');
INSERT INTO `douban` VALUES ('79', '蝴蝶效应', '2004/美国加拿大/剧情悬疑科幻惊悚', '8.7', '463770人评价', '人的命运被自己瞬间的抉择改变。');
INSERT INTO `douban` VALUES ('80', '春光乍泄', '1997/香港日本韩国/剧情爱情同性', '8.8', '305186人评价', '爱情纠缠，男女一致。');
INSERT INTO `douban` VALUES ('81', '入殓师', '2008/日本/剧情', '8.8', '362878人评价', '死可能是一道门，逝去并不是终结，而是超越，走向下一程。');
INSERT INTO `douban` VALUES ('82', '心灵捕手', '1997/美国/剧情', '8.8', '336777人评价', '人生中应该拥有这样的一段豁然开朗。');
INSERT INTO `douban` VALUES ('83', '猫鼠游戏', '2002/美国加拿大/传记犯罪剧情', '8.8', '304875人评价', '骗子大师和执著警探的你追我跑故事。 ');
INSERT INTO `douban` VALUES ('84', '布达佩斯大饭店', '2014/美国德国英国/剧情喜剧冒险', '8.8', '404877人评价', '小清新的故事里注入了大历史的情怀。');
INSERT INTO `douban` VALUES ('85', '禁闭岛', '2010/美国/剧情悬疑惊悚', '8.7', '445013人评价', '昔日翩翩少年，今日大腹便便。');
INSERT INTO `douban` VALUES ('86', '玛丽和马克思', '2009/澳大利亚/剧情动画', '8.9', '263225人评价', '你是我最好的朋友，你是我唯一的朋友 。');
INSERT INTO `douban` VALUES ('87', '阳光灿烂的日子', '1994/中国大陆香港/剧情', '8.8', '329949人评价', '一场华丽的意淫。');
INSERT INTO `douban` VALUES ('88', '幽灵公主', '1997/日本/动画奇幻冒险', '8.8', '282180人评价', '人与自然的战争史诗。');
INSERT INTO `douban` VALUES ('89', '第六感', '1999/美国/剧情悬疑惊悚', '8.8', '282022人评价', '深入内心的恐怖，出人意料的结局。');
INSERT INTO `douban` VALUES ('90', '狩猎', '2012/丹麦瑞典/剧情', '9.1', '166610人评价', '人言可畏。');
INSERT INTO `douban` VALUES ('91', '重庆森林', '1994/香港/剧情爱情', '8.7', '402150人评价', '寂寞没有期限。');
INSERT INTO `douban` VALUES ('92', '穿条纹睡衣的男孩', '2008/英国美国/剧情战争', '8.9', '196018人评价', '尽管有些不切实际的幻想，这部电影依旧是一部感人肺腑的佳作。');
INSERT INTO `douban` VALUES ('93', '致命ID', '2003/美国/剧情悬疑惊悚', '8.7', '388010人评价', '最不可能的那个人永远是最可能的。');
INSERT INTO `douban` VALUES ('94', '断背山', '2005/美国加拿大/剧情爱情同性家庭', '8.7', '385949人评价', '每个人心中都有一座断背山。');
INSERT INTO `douban` VALUES ('95', '加勒比海盗', '2003/美国/动作冒险奇幻', '8.6', '429082人评价', '约翰尼·德普的独角戏。');
INSERT INTO `douban` VALUES ('96', '阿凡达', '2009/美国英国/动作战争科幻冒险', '8.6', '642904人评价', '绝对意义上的美轮美奂。');
INSERT INTO `douban` VALUES ('97', '大鱼', '2003/美国/剧情家庭奇幻冒险', '8.7', '301577人评价', '抱着梦想而活着的人是幸福的，怀抱梦想而死去的人是不朽的。');
INSERT INTO `douban` VALUES ('98', '摩登时代', '1936/美国/喜剧剧情爱情', '9.2', '116158人评价', '大时代中的人生，小人物的悲喜。');
INSERT INTO `douban` VALUES ('99', '告白', '2010/日本/剧情惊悚', '8.7', '408223人评价', '没有一人完全善，也没有一人完全恶。');
INSERT INTO `douban` VALUES ('100', '一一', '2000/台湾日本/剧情爱情家庭', '9.0', '184226人评价', '我们都曾经是一一。');
INSERT INTO `douban` VALUES ('101', '射雕英雄传之东成西就', '1993/香港/喜剧古装', '8.7', '328571人评价', '百看不厌。 ');
INSERT INTO `douban` VALUES ('102', '甜蜜蜜', '1996/香港/剧情爱情', '8.8', '270406人评价', '相逢只要一瞬间，等待却像是一辈子。');
INSERT INTO `douban` VALUES ('103', '阳光姐妹淘', '2011/韩国/剧情喜剧', '8.8', '323808人评价', '再多各自牛逼的时光，也比不上一起傻逼的岁月。 ');
INSERT INTO `douban` VALUES ('104', '消失的爱人', '2014/美国/剧情犯罪悬疑惊悚', '8.7', '438021人评价', '年度最佳date movie。');
INSERT INTO `douban` VALUES ('105', '爱在黎明破晓前', '1995/美国奥地利瑞士/剧情爱情', '8.7', '269957人评价', '缘分是个连绵词，最美不过一瞬。');
INSERT INTO `douban` VALUES ('106', '上帝之城', '2002/巴西法国/犯罪剧情', '8.9', '179569人评价', '被上帝抛弃了的上帝之城。');
INSERT INTO `douban` VALUES ('107', '喜剧之王', '1999/香港/喜剧剧情爱情', '8.6', '397700人评价', '我是一个演员。');
INSERT INTO `douban` VALUES ('108', '小森林 夏秋篇', '2014/日本/剧情', '8.9', '176767人评价', '那些静得只能听见呼吸的日子里，你明白孤独即生活。');
INSERT INTO `douban` VALUES ('109', '侧耳倾听', '1995/日本/剧情爱情动画', '8.8', '209361人评价', '少女情怀总是诗。');
INSERT INTO `douban` VALUES ('110', '倩女幽魂', '1987/香港/剧情爱情武侠古装', '8.6', '323326人评价', '两张绝世的脸。 ');
INSERT INTO `douban` VALUES ('111', '恐怖直播', '2013/韩国/剧情犯罪悬疑', '8.7', '284242人评价', '恐怖分子的“秋菊打官司”。');
INSERT INTO `douban` VALUES ('112', '风之谷', '1984/日本/动画奇幻冒险', '8.8', '208976人评价', '动画片的圣经。');
INSERT INTO `douban` VALUES ('113', '爱在日落黄昏时', '2004/美国/剧情爱情', '8.8', '238414人评价', '九年后的重逢是世俗和责任的交叠，没了悸动和青涩，沧桑而温暖。');
INSERT INTO `douban` VALUES ('114', '超脱', '2011/美国/剧情', '8.8', '215037人评价', '穷尽一生，我们要学会的，不过是彼此拥抱。');
INSERT INTO `douban` VALUES ('115', '红辣椒', '2006/日本/动画悬疑科幻惊悚', '8.9', '168563人评价', '梦的勾结。');
INSERT INTO `douban` VALUES ('116', '菊次郎的夏天', '1999/日本/剧情喜剧', '8.8', '230176人评价', '从没见过那么流氓的温柔，从没见过那么温柔的流氓。');
INSERT INTO `douban` VALUES ('117', '驯龙高手', '2010/美国/喜剧动画奇幻冒险', '8.7', '348175人评价', '和谐的生活离不开摸头与被摸头。');
INSERT INTO `douban` VALUES ('118', '幸福终点站', '2004/美国/喜剧剧情爱情', '8.7', '266543人评价', '有时候幸福需要等一等。 ');
INSERT INTO `douban` VALUES ('120', '借东西的小人阿莉埃蒂', '2010/日本/动画奇幻冒险', '8.7', '258047人评价', '曾经的那段美好会沉淀为一辈子的记忆。');
INSERT INTO `douban` VALUES ('121', '杀人回忆', '2003/韩国/犯罪剧情悬疑惊悚', '8.7', '250078人评价', '关于连环杀人悬案的集体回忆。');
INSERT INTO `douban` VALUES ('122', '七武士', '1954/日本/动作冒险剧情', '9.2', '93824人评价', '时代悲歌。');
INSERT INTO `douban` VALUES ('123', '岁月神偷', '2010/香港中国大陆/剧情家庭', '8.6', '351507人评价', '岁月流逝，来日可追。');
INSERT INTO `douban` VALUES ('124', '请以你的名字呼唤我', '2017/意大利法国巴西美国/剧情爱情同性', '8.8', '238819人评价', '沉醉在电影的情感和视听氛围中无法自拔。');
INSERT INTO `douban` VALUES ('125', '哈利·波特与死亡圣器(下)', '2011/美国英国/剧情悬疑奇幻冒险', '8.7', '335645人评价', '10年的完美句点。');
INSERT INTO `douban` VALUES ('126', '萤火虫之墓', '1988/日本/动画剧情战争', '8.7', '237517人评价', '幸福是生生不息，却难以触及的远。 ');
INSERT INTO `douban` VALUES ('127', '怪兽电力公司', '2001/美国/儿童喜剧动画奇幻冒险', '8.6', '298885人评价', '不要给它起名字，起了名字就有感情了。');
INSERT INTO `douban` VALUES ('128', '小森林 冬春篇', '2015/日本/剧情', '9.0', '153025人评价', '尊敬他人，尊敬你生活的这片土地，明白孤独是人生的常态。');
INSERT INTO `douban` VALUES ('129', '寻梦环游记', '2017/美国/喜剧动画奇幻音乐', '9.0', '602465人评价', 'None');
INSERT INTO `douban` VALUES ('130', '谍影重重3', '2007/美国德国/动作悬疑惊悚', '8.7', '215885人评价', '像吃了苏打饼一样干脆的电影。');
INSERT INTO `douban` VALUES ('131', '喜宴', '1993/台湾美国/剧情喜剧爱情同性家庭', '8.8', '166994人评价', '中国家庭的喜怒哀乐忍。');
INSERT INTO `douban` VALUES ('132', '东邪西毒', '1994/香港台湾/剧情动作爱情武侠古装', '8.6', '304404人评价', '电影诗。');
INSERT INTO `douban` VALUES ('133', '电锯惊魂', '2004/美国/悬疑惊悚恐怖', '8.7', '233981人评价', '真相就在眼前。');
INSERT INTO `douban` VALUES ('134', '贫民窟的百万富翁', '2008/英国美国/剧情爱情', '8.5', '445743人评价', '上帝之城+猜火车+阿甘正传+开心辞典=山寨富翁');
INSERT INTO `douban` VALUES ('135', '疯狂原始人', '2013/美国/喜剧动画冒险', '8.7', '437846人评价', '老少皆宜，这就是好莱坞动画的魅力。');
INSERT INTO `douban` VALUES ('136', '7号房的礼物', '2013/韩国/剧情喜剧家庭', '8.7', '219409人评价', '《我是山姆》的《美丽人生》。');
INSERT INTO `douban` VALUES ('137', '记忆碎片', '2000/美国/犯罪剧情悬疑惊悚', '8.6', '326720人评价', '一个针管引发的血案。');
INSERT INTO `douban` VALUES ('138', '萤火之森', '2011/日本/剧情爱情动画奇幻', '8.8', '202420人评价', '触不到的恋人。');
INSERT INTO `douban` VALUES ('139', '黑天鹅', '2010/美国/剧情惊悚', '8.5', '483398人评价', '黑暗之美。');
INSERT INTO `douban` VALUES ('140', '真爱至上', '2003/英国美国法国/喜剧剧情爱情', '8.5', '361161人评价', '爱，是个动词。');
INSERT INTO `douban` VALUES ('141', '英雄本色', '1986/香港/动作犯罪', '8.6', '217204人评价', '英雄泪短，兄弟情长。 ');
INSERT INTO `douban` VALUES ('142', '超能陆战队', '2014/美国/喜剧动作科幻动画冒险', '8.6', '457095人评价', 'Balalala~~~');
INSERT INTO `douban` VALUES ('143', '雨人', '1988/美国/剧情', '8.7', '236503人评价', '生活在自己的世界里，也可以让周围的人显得可笑和渺小。');
INSERT INTO `douban` VALUES ('144', '唐伯虎点秋香', '1993/香港/喜剧爱情古装', '8.5', '423587人评价', '华太师是黄霑，吴镇宇四大才子之一。');
INSERT INTO `douban` VALUES ('145', '蝙蝠侠：黑暗骑士崛起', '2012/美国英国/剧情动作科幻犯罪惊悚', '8.6', '348307人评价', '诺兰就是保证。');
INSERT INTO `douban` VALUES ('146', '心迷宫', '2014/中国大陆/剧情犯罪悬疑', '8.7', '225698人评价', '荒诞讽刺，千奇百巧，抽丝剥茧，百转千回。');
INSERT INTO `douban` VALUES ('147', '卢旺达饭店', '2004/英国南非意大利美国/剧情历史战争', '8.9', '142097人评价', '当这个世界闭上双眼，他却敞开了怀抱。');
INSERT INTO `douban` VALUES ('148', '傲慢与偏见', '2005/法国英国美国/剧情爱情', '8.5', '362061人评价', '爱是摈弃傲慢与偏见之后的曙光。');
INSERT INTO `douban` VALUES ('149', '荒蛮故事', '2014/阿根廷西班牙/剧情喜剧犯罪', '8.8', '180873人评价', '始于荒诞，止于更荒诞。');
INSERT INTO `douban` VALUES ('150', '海洋', '2009/法国瑞士西班牙美国阿联酋/纪录片', '9.0', '107628人评价', '大海啊，不全是水。');
INSERT INTO `douban` VALUES ('151', '纵横四海', '1991/香港/剧情喜剧动作犯罪', '8.7', '183831人评价', '香港浪漫主义警匪动作片的巅峰之作。');
INSERT INTO `douban` VALUES ('152', '海边的曼彻斯特', '2016/美国/剧情家庭', '8.6', '247402人评价', '我们都有权利不与自己的过去和解。');
INSERT INTO `douban` VALUES ('153', '无人知晓', '2004/日本/剧情', '9.1', '94237人评价', '我的平常生活就是他人的幸福。');
INSERT INTO `douban` VALUES ('154', '时空恋旅人', '2013/英国/剧情爱情奇幻', '8.7', '248619人评价', '把每天当作最后一天般珍惜度过，积极拥抱生活，就是幸福。');
INSERT INTO `douban` VALUES ('155', '教父3', '1990/美国/剧情犯罪', '8.8', '158227人评价', '任何信念的力量，都无法改变命运。');
INSERT INTO `douban` VALUES ('156', '虎口脱险', '1966/法国英国/喜剧战争', '8.9', '122849人评价', '永远看不腻的喜剧。');
INSERT INTO `douban` VALUES ('157', '完美的世界', '1993/美国/剧情犯罪', '9.0', '99253人评价', '坏人的好总是比好人的好来得更感人。');
INSERT INTO `douban` VALUES ('158', '玩具总动员3', '2010/美国/喜剧动画奇幻冒险', '8.8', '226858人评价', '跨度十五年的欢乐与泪水。');
INSERT INTO `douban` VALUES ('159', '花样年华', '2000/香港/剧情爱情', '8.6', '290205人评价', '偷情本没有这样美。');
INSERT INTO `douban` VALUES ('160', '燃情岁月', '1994/美国/剧情爱情西部家庭', '8.7', '166161人评价', '传奇，不是每个人都可以拥有。');
INSERT INTO `douban` VALUES ('161', '恋恋笔记本', '2004/美国/剧情爱情', '8.5', '333747人评价', '爱情没有那么多借口，如果不能圆满，只能说明爱的不够。 ');
INSERT INTO `douban` VALUES ('162', '达拉斯买家俱乐部', '2013/美国/剧情传记同性', '8.7', '223763人评价', 'Jared Leto的腿比女人还美！');
INSERT INTO `douban` VALUES ('163', '血战钢锯岭', '2016/美国澳大利亚/剧情传记历史战争', '8.7', '389844人评价', '优秀的战争片不会美化战场，不会粉饰死亡，不会矮化敌人，不会无视常识，最重要的，不会宣扬战争。');
INSERT INTO `douban` VALUES ('164', '二十二', '2015/中国大陆/纪录片', '8.7', '133147人评价', '有一些东西不应该被遗忘。');
INSERT INTO `douban` VALUES ('165', '雨中曲', '1952/美国/喜剧歌舞爱情', '9.0', '107229人评价', '骨灰级歌舞片。');
INSERT INTO `douban` VALUES ('166', '魂断蓝桥', '1940/美国/剧情战争爱情', '8.8', '147181人评价', '中国式内在的美国电影。');
INSERT INTO `douban` VALUES ('167', '穿越时空的少女', '2006/日本/剧情爱情科幻动画', '8.6', '214306人评价', '爱上未来的你。 ');
INSERT INTO `douban` VALUES ('168', '猜火车', '1996/英国/犯罪剧情', '8.5', '278875人评价', '不可猜的青春迷笛。 ');
INSERT INTO `douban` VALUES ('169', '我是山姆', '2001/美国/剧情家庭', '8.8', '125790人评价', '爱并不需要智商 。');
INSERT INTO `douban` VALUES ('170', '冰川时代', '2002/美国/喜剧动画冒险', '8.5', '322305人评价', '松鼠才是角儿。');
INSERT INTO `douban` VALUES ('171', '人工智能', '2001/美国/冒险剧情科幻', '8.6', '222849人评价', '对爱的执着，可以超越一切。');
INSERT INTO `douban` VALUES ('172', '爆裂鼓手', '2014/美国/剧情音乐', '8.6', '278814人评价', '这个世界从不善待努力的人，努力了也不一定会成功，但是知道自己在努力，就是活下去的动力。');
INSERT INTO `douban` VALUES ('173', '头脑特工队', '2015/美国/喜剧动画冒险', '8.7', '280065人评价', '愿我们都不用长大，每一座城堡都能永远存在。');
INSERT INTO `douban` VALUES ('174', '被解救的姜戈', '2012/美国/剧情动作西部冒险', '8.6', '302247人评价', '热血沸腾，那个低俗、性感的无耻混蛋又来了。');
INSERT INTO `douban` VALUES ('175', '未麻的部屋', '1997/日本/动画奇幻惊悚', '8.8', '119929人评价', '好的剧本是，就算你猜到了结局也猜不到全部。');
INSERT INTO `douban` VALUES ('176', '罗生门', '1950/日本/犯罪剧情悬疑', '8.7', '149989人评价', '人生的N种可能性。');
INSERT INTO `douban` VALUES ('177', '浪潮', '2008/德国/剧情惊悚', '8.7', '153247人评价', '世界离独裁只有五天。');
INSERT INTO `douban` VALUES ('178', '你的名字。', '2016/日本/剧情爱情动画', '8.4', '595776人评价', '穿越错位的时空，仰望陨落的星辰，你没留下你的名字，我却无法忘记那句“我爱你”。');
INSERT INTO `douban` VALUES ('179', '香水', '2006/德国法国西班牙美国/剧情犯罪奇幻', '8.4', '318168人评价', '一个单凭体香达到高潮的男人。');
INSERT INTO `douban` VALUES ('180', '朗读者', '2008/美国德国/剧情爱情', '8.5', '306558人评价', '当爱情跨越年龄的界限，它似乎能变得更久远一点，成为一种责任，一种水到渠成的相濡以沫。 ');
INSERT INTO `douban` VALUES ('181', '阿飞正传', '1990/香港/犯罪剧情爱情', '8.5', '247737人评价', '王家卫是一种风格，张国荣是一个代表。');
INSERT INTO `douban` VALUES ('182', '房间', '2015/爱尔兰加拿大英国美国/剧情家庭', '8.8', '190253人评价', '被偷走的岁月，被伤害的生命，被禁锢的灵魂，终将被希望和善意救赎。');
INSERT INTO `douban` VALUES ('183', '恐怖游轮', '2009/英国澳大利亚/剧情悬疑惊悚', '8.4', '385843人评价', '不要企图在重复中寻找已经失去的爱。');
INSERT INTO `douban` VALUES ('184', '可可西里', '2004/中国大陆香港/剧情犯罪', '8.7', '150424人评价', '坚硬的信仰。');
INSERT INTO `douban` VALUES ('185', '模仿游戏', '2014/英国美国/剧情传记战争同性', '8.6', '303025人评价', '他给机器起名“克里斯托弗”，因为这是他初恋的名字。');
INSERT INTO `douban` VALUES ('186', '无敌破坏王', '2012/美国/喜剧动画奇幻冒险', '8.7', '237348人评价', '迪士尼和皮克斯拿错剧本的产物。');
INSERT INTO `douban` VALUES ('187', '一个叫欧维的男人决定去死', '2015/瑞典/剧情', '8.8', '154457人评价', '惠及一生的美丽。');
INSERT INTO `douban` VALUES ('188', '忠犬八公物语', '1987/日本/剧情', '9.1', '76012人评价', '养狗三日，便会对你终其一生。');
INSERT INTO `douban` VALUES ('189', '一次别离', '2011/伊朗法国/剧情家庭', '8.7', '150928人评价', '只有有信仰的人才能说出事实真相。');
INSERT INTO `douban` VALUES ('190', '战争之王', '2005/美国法国/剧情犯罪', '8.6', '197409人评价', '做一颗让别人需要你的棋子。');
INSERT INTO `douban` VALUES ('191', '魔女宅急便', '1989/日本/动画奇幻冒险', '8.5', '230452人评价', '宫崎骏的电影总让人感觉世界是美好的，阳光明媚的。');
INSERT INTO `douban` VALUES ('192', '追随', '1998/英国/犯罪悬疑惊悚', '8.9', '94288人评价', '诺兰的牛逼来源于内心散发出的恐惧。');
INSERT INTO `douban` VALUES ('193', '谍影重重', '2002/美国德国捷克/动作悬疑惊悚', '8.5', '224788人评价', '哗啦啦啦啦，天在下雨，哗啦啦啦啦，云在哭泣……找自己。');
INSERT INTO `douban` VALUES ('194', '完美陌生人', '2016/意大利/剧情喜剧', '8.6', '254212人评价', '来啊，互相伤害啊！');
INSERT INTO `douban` VALUES ('195', '撞车', '2004/美国德国/犯罪剧情', '8.6', '196583人评价', '天使与魔鬼的冲撞。');
INSERT INTO `douban` VALUES ('196', '哪吒闹海', '1979/中国大陆/冒险动画奇幻', '8.9', '99032人评价', '想你时你在闹海。');
INSERT INTO `douban` VALUES ('197', '牯岭街少年杀人事件', '1991/台湾/剧情犯罪', '8.8', '126503人评价', '弱者送给弱者的一刀。');
INSERT INTO `douban` VALUES ('198', '地球上的星星', '2007/印度/剧情儿童家庭', '8.9', '100458人评价', '天使保护事件始末。');
INSERT INTO `douban` VALUES ('199', '谍影重重2', '2004/美国德国/动作悬疑惊悚', '8.6', '187030人评价', '谁说王家卫镜头很晃？');
INSERT INTO `douban` VALUES ('200', '惊魂记', '1960/美国/悬疑惊悚恐怖', '8.9', '100323人评价', '故事的反转与反转，分裂电影的始祖。');
INSERT INTO `douban` VALUES ('201', '青蛇', '1993/香港/剧情奇幻古装', '8.5', '261967人评价', '人生如此，浮生如斯。谁人言，花彼岸，此生情长意短。谁都是不懂爱的罢了。');
INSERT INTO `douban` VALUES ('202', '梦之安魂曲', '2000/美国/剧情', '8.7', '128012人评价', '一场没有春天的噩梦。');
INSERT INTO `douban` VALUES ('203', '黑客帝国3：矩阵革命', '2003/美国澳大利亚/动作科幻', '8.6', '185686人评价', '不得不说，《黑客帝国》系列是商业片与科幻、哲学完美结合的典范。');
INSERT INTO `douban` VALUES ('204', '小萝莉的猴神大叔', '2015/印度/剧情喜剧动作', '8.5', '209258人评价', '宝莱坞的萝莉与大叔。');
INSERT INTO `douban` VALUES ('205', '再次出发之纽约遇见你', '2013/美国/喜剧爱情音乐', '8.5', '205781人评价', '爱我就给我看你的播放列表。');
INSERT INTO `douban` VALUES ('206', '海街日记', '2015/日本/剧情家庭', '8.7', '169143人评价', '是枝裕和的家庭习作。');
INSERT INTO `douban` VALUES ('207', '新龙门客栈', '1992/香港中国大陆/剧情动作武侠古装', '8.5', '218638人评价', '嬉笑怒骂，调风动月。');
INSERT INTO `douban` VALUES ('208', '步履不停', '2008/日本/剧情家庭', '8.8', '107839人评价', '日本的家庭电影已经是世界巅峰了，步履不停是巅峰中的佳作。');
INSERT INTO `douban` VALUES ('209', '东京物语', '1953/日本/剧情家庭', '9.2', '61227人评价', '东京那么大，如果有一天走失了，恐怕一辈子不能再相见。');
INSERT INTO `douban` VALUES ('210', '终结者2：审判日', '1991/美国法国/动作科幻', '8.6', '165149人评价', '少见的超越首部的续集，动作片中的经典。');
INSERT INTO `douban` VALUES ('211', '源代码', '2011/美国加拿大/科幻悬疑惊悚', '8.4', '460325人评价', '邓肯·琼斯继《月球》之后再度奉献出一部精彩绝伦的科幻佳作。');
INSERT INTO `douban` VALUES ('212', '初恋这件小事', '2010/泰国/剧情喜剧爱情', '8.3', '536621人评价', '黑小鸭速效美白记。');
INSERT INTO `douban` VALUES ('213', '绿里奇迹', '1999/美国/犯罪剧情奇幻悬疑', '8.7', '124200人评价', '天使暂时离开。');
INSERT INTO `douban` VALUES ('214', '城市之光', '1931/美国/喜剧剧情爱情', '9.2', '54001人评价', '永远的小人物，伟大的卓别林。');
INSERT INTO `douban` VALUES ('215', '末路狂花', '1991/美国法国/犯罪剧情惊悚', '8.7', '120518人评价', '没有了退路，只好飞向自由。');
INSERT INTO `douban` VALUES ('216', '疯狂的石头', '2006/中国大陆香港/喜剧犯罪', '8.3', '373418人评价', '中国版《两杆大烟枪》。');
INSERT INTO `douban` VALUES ('217', '爱在午夜降临前', '2013/美国/剧情爱情', '8.8', '138427人评价', '所谓爱情，就是话唠一路，都不会心生腻烦，彼此嫌弃。');
INSERT INTO `douban` VALUES ('218', '无耻混蛋', '2009/美国德国/剧情犯罪', '8.5', '254936人评价', '昆汀同学越来越变态了，比北野武还杜琪峰。');
INSERT INTO `douban` VALUES ('219', '秒速5厘米', '2007/日本/动画剧情爱情', '8.3', '352461人评价', '青春就是放弃和怀念。');
INSERT INTO `douban` VALUES ('220', '这个男人来自地球', '2007/美国/剧情科幻', '8.5', '211053人评价', '科幻真正的魅力不是视觉效果能取代的。 ');
INSERT INTO `douban` VALUES ('221', '勇闯夺命岛', '1996/美国/动作冒险', '8.6', '160764人评价', '类型片的极致。 ');
INSERT INTO `douban` VALUES ('222', 'E.T. 外星人', '1982/美国/剧情科幻', '8.5', '179624人评价', '生病的E.T.皮肤的颜色就像柿子饼。');
INSERT INTO `douban` VALUES ('223', '变脸', '1997/美国/动作科幻犯罪惊悚', '8.4', '241931人评价', '当发哥的风衣、墨镜出现在了凯奇身上⋯⋯');
INSERT INTO `douban` VALUES ('224', '碧海蓝天', '1988/法国美国意大利/剧情爱情', '8.7', '115556人评价', '在那片深蓝中，感受来自大海的忧伤寂寞与美丽自由。');
INSERT INTO `douban` VALUES ('225', '卡萨布兰卡', '1942/美国/剧情爱情战争', '8.6', '141467人评价', '世界上有那么多女人那么多酒馆，但她偏偏走进我的这家。');
INSERT INTO `douban` VALUES ('226', '黄金三镖客', '1966/意大利西班牙西德/冒险西部', '9.1', '60557人评价', '最棒的西部片。');
INSERT INTO `douban` VALUES ('227', '发条橙', '1971/英国美国/犯罪剧情科幻', '8.5', '208969人评价', '我完全康复了。');
INSERT INTO `douban` VALUES ('228', '彗星来的那一夜', '2013/美国英国/科幻悬疑惊悚', '8.4', '221815人评价', '小成本大魅力。');
INSERT INTO `douban` VALUES ('229', '聚焦', '2015/美国/剧情传记', '8.8', '149745人评价', '新闻人的理性求真。');
INSERT INTO `douban` VALUES ('230', '血钻', '2006/美国德国/剧情惊悚冒险', '8.6', '158265人评价', '每个美丽事物背后都是滴血的现实。');
INSERT INTO `douban` VALUES ('231', '海盗电台', '2009/英国德国法国/剧情喜剧音乐', '8.6', '181068人评价', '生命不止，摇滚不死。');
INSERT INTO `douban` VALUES ('232', '美国丽人', '1999/美国/剧情爱情家庭', '8.5', '209788人评价', '每个人的内心都是深不可测的大海。 ');
INSERT INTO `douban` VALUES ('233', '非常嫌疑犯', '1995/德国美国/剧情犯罪悬疑惊悚', '8.6', '137234人评价', '我不信仰上帝，但我敬畏上帝。');
INSERT INTO `douban` VALUES ('234', '国王的演讲', '2010/英国澳大利亚美国/剧情传记历史', '8.3', '386096人评价', '皇上无话儿。');
INSERT INTO `douban` VALUES ('235', '荒野生存', '2007/美国/冒险传记剧情', '8.6', '144614人评价', '出门必备：本草纲目。');
INSERT INTO `douban` VALUES ('236', '英国病人', '1996/美国英国/爱情剧情战争', '8.5', '192339人评价', 'In memory, love lives forever...');
INSERT INTO `douban` VALUES ('237', '黑鹰坠落', '2001/美国/动作历史战争', '8.6', '138652人评价', '还原真实而残酷的战争。');
INSERT INTO `douban` VALUES ('238', '我爱你', '2011/韩国/剧情爱情', '9.0', '69393人评价', '你要相信，这世上真的有爱存在，不管在什么年纪 ');
INSERT INTO `douban` VALUES ('239', '迁徙的鸟', '2001/法国德国意大利西班牙瑞士/纪录片', '9.1', '56553人评价', '最美的飞翔。');
INSERT INTO `douban` VALUES ('240', '遗愿清单', '2007/美国/冒险喜剧剧情', '8.5', '154043人评价', '用剩余不多的时间，去燃烧整个生命。');
INSERT INTO `douban` VALUES ('241', '千钧一发', '1997/美国/剧情科幻惊悚', '8.7', '104888人评价', '一部能引人思考的科幻励志片。');
INSERT INTO `douban` VALUES ('242', '勇士', '2011/美国/剧情运动家庭', '8.9', '97355人评价', '热血沸腾，相当完美的娱乐拳击大餐。');
INSERT INTO `douban` VALUES ('243', '荒岛余生', '2000/美国/冒险剧情', '8.5', '157801人评价', '一个人的独角戏。');
INSERT INTO `douban` VALUES ('244', '2001太空漫游', '1968/英国美国/科幻惊悚冒险', '8.7', '113346人评价', '现代科幻电影的开山之作，最伟大导演的最伟大影片。');
INSERT INTO `douban` VALUES ('245', '枪火', '1999/香港/剧情动作犯罪', '8.7', '114744人评价', '一群演技精湛的戏骨，奉献出一个精致的黑帮小品，成就杜琪峰群戏的巅峰之作。');
INSERT INTO `douban` VALUES ('246', '燕尾蝶', '1996/日本/犯罪剧情', '8.6', '116334人评价', '现实与童话交相辉映的旅程。');
INSERT INTO `douban` VALUES ('247', '叫我第一名', '2008/美国/剧情传记', '8.6', '121410人评价', '乐观比一切都有力量。');
INSERT INTO `douban` VALUES ('248', '穆赫兰道', '2001/法国美国/剧情悬疑惊悚', '8.3', '263343人评价', '大卫·林奇的梦境迷宫。');
INSERT INTO `douban` VALUES ('249', '大卫·戈尔的一生', '2003/美国德国英国/剧情犯罪悬疑', '8.6', '111793人评价', '捍卫人权只是信仰，一点不妨碍其行为的残忍。');
INSERT INTO `douban` VALUES ('250', '上帝也疯狂', '1980/博茨瓦纳南非/喜剧', '8.7', '107110人评价', '纯净原始的笑与感动。');

-- ----------------------------
-- Table structure for pms_user
-- ----------------------------
DROP TABLE IF EXISTS `pms_user`;
CREATE TABLE `pms_user` (
  `id` varchar(255) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `sex` varchar(255) DEFAULT NULL,
  `age` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=gb2312;

-- ----------------------------
-- Records of pms_user
-- ----------------------------
INSERT INTO `pms_user` VALUES ('4028668167e5afe00167e5b07c81000a', '李三', 'F', '23');
INSERT INTO `pms_user` VALUES ('4028668167e5afe00167e5b09447000b', 'test_0', 'M', '10');
INSERT INTO `pms_user` VALUES ('4028668167e5afe00167e5b0945d000c', 'test_1', 'M', '11');
INSERT INTO `pms_user` VALUES ('4028668167e5afe00167e5b09474000d', 'test_2', 'M', '12');
INSERT INTO `pms_user` VALUES ('4028668167e5afe00167e5b09498000e', 'test_3', 'M', '13');
INSERT INTO `pms_user` VALUES ('4028668167e5afe00167e5b094b7000f', 'test_4', 'M', '14');
INSERT INTO `pms_user` VALUES ('4028668167e5afe00167e5b094d50010', 'test_5', 'M', '15');
INSERT INTO `pms_user` VALUES ('4028668167e5afe00167e5b094f70011', 'test_6', 'M', '16');
INSERT INTO `pms_user` VALUES ('4028668167e5afe00167e5b095100012', 'test_7', 'M', '17');
INSERT INTO `pms_user` VALUES ('4028668167e5afe00167e5b095540013', 'test_8', 'M', '18');
INSERT INTO `pms_user` VALUES ('4028668167e5afe00167e5b0956c0014', 'test_9', 'M', '19');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '唯一ID',
  `age` int(11) NOT NULL COMMENT '年齡',
  `name` varchar(255) DEFAULT NULL COMMENT '姓名',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=gb2312;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1', '32', '李修改');
INSERT INTO `user` VALUES ('4', '233', '诸葛连弩');
INSERT INTO `user` VALUES ('5', '25', '李测试');

-- ----------------------------
-- View structure for v_douban_count
-- ----------------------------
DROP VIEW IF EXISTS `v_douban_count`;
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost`  VIEW `v_douban_count` AS (
SELECT serial_number,movie_name,star,evaluate,`describe`,introduce,substring_index(introduce,'/', 1) AS yearDate ,substring_index(introduce,'/', -1) AS type, 
substring_index(substring_index(introduce,'/', 2),'/', -1) AS country FROM `douban`
) ;
